Revit 2016 API
TextNode.IsBold Property
 Indicates whether the text style is set to bold text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public bool IsBold { get; }
Visual Basic
Public ReadOnly Property IsBold As Boolean
	Get
Visual C++
public:
property bool IsBold {
	bool get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace